{"keras_version": "2.0.4", "backend": "theano", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"use_bias": true, "strides": [1, 1], "bias_regularizer": null, "name": "conv2d_8", "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "filters": 16, "batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "padding": "valid"}}, {"class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "axis": -1, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_6", "center": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "config": {"use_bias": true, "strides": [1, 1], "bias_regularizer": null, "name": "conv2d_9", "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "filters": 16, "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "padding": "valid"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_3", "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "axis": -1, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_7", "center": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "rate": 0.25, "trainable": true}}, {"class_name": "Conv2D", "config": {"use_bias": true, "strides": [1, 1], "bias_regularizer": null, "name": "conv2d_10", "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "filters": 32, "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "padding": "valid"}}, {"class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "axis": -1, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_8", "center": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "config": {"use_bias": true, "strides": [1, 1], "bias_regularizer": null, "name": "conv2d_11", "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "filters": 32, "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "padding": "valid"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_4", "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "axis": -1, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_9", "center": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"name": "dropout_6", "rate": 0.25, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "activation": "relu", "bias_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "units": 512, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}}, {"class_name": "Dropout", "config": {"name": "dropout_7", "rate": 0.25, "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "activation": "relu", "bias_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "units": 1024, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_5", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}}, {"class_name": "Dropout", "config": {"name": "dropout_8", "rate": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "activation": "softmax", "bias_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "units": 10, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_6", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}}]}